library("stats")





AR<-function(theta,n){ # Вариация процесса, с передаваемыми theta
    p<-length(theta)
    x<-rnorm(n+p)# Вектор размерности n+p

    for (i in (p+1):(n+p)) {
    x[i] <- sum(theta * rev(x[(i-p):(i-1)])) + rnorm(1)
    }

    x <- x[(p+1):(n+p)]

    return(x)
}


set.seed(1) #Начальное состояние для генератора случаных чисел. Заменить на /dev/random
theta <- c(0.6, -0.2)
n <- 100
x <- AR(theta,n)

png(filename = "./plots/AR_plot.png")# Открываю вирутальное графическое утсройство
plot.ts(x) # Рисую туда каляку маляку
dev.off() # Закрываю вирутальное графичесое устройтво


######################################################################################
# Заготовки оформления с прошлой реализации. Пока просто болтаются.


##################################
#        "Type of theta:         #
#        1 - |theta| < 1         #
#        2 - |theta| = 1         #
#        3 - |theta| > 1"        #
##################################


########################################################################################
#                                       Start test                                     #
########################################################################################



############ 1 ##########
############ 2 ##########
############ 3 ##########
############ 4 ##########
############ 5 ##########
############ 6 ##########