library("stats")

AR<-function(theta,n){ # Вариация процесса, с передаваемыми theta
    p<-length(theta)
    x<-rnorm(n+p)# Вектор размерности n+p

    for (i in (p+1):(n+p)) {
    x[i] <- sum(theta * rev(x[(i-p):(i-1)])) + rnorm(1)
    }

    x <- x[(p+1):(n+p)]

    return(x)
}


# png(filename = "./plots/AR_plot.png")# Открываю вирутальное графическое утсройство
# plot.ts(x) # Рисую туда каляку маляку
# dev.off() # Закрываю вирутальное графичесое устройтво


######################################################################################
# Заготовки оформления с прошлой реализации. Пока просто болтаются.


##################################
#        "Типы тета:         #
#        1 - |theta| < 1         #
#        2 - |theta| = 1         #
#        3 - |theta| > 1"        #
##################################

theta1 <- rnorm(1, mean=0, sd=0.5)

theta2 <- sample(c(-1, 1), 1)

theta3 <- rnorm(1, mean=2, sd=1)

#######################################################
#                      Задания                        #
#######################################################

############ 1 ##########

# 1.1
theta <- c(theta1)
n<-10
x<- AR(theta,n)
plot.ts(x)

# 1.2
theta <- c(theta2)
n<-10
x<- AR(theta,n)
plot.ts(x)

# 1.3

theta <- c(theta3)
n<-10
x<- AR(theta,n)
plot.ts(x)

############ 2 ##########
############ 3 ##########
############ 4 ##########
############ 5 ##########
############ 6 ##########